In [2]:
import pandas as pd
import numpy as np

In [4]:
np.random.seed(101)

In [24]:
df = pd.DataFrame(np.random.randn(5, 4), index=["A", "B", "C", "D", "E"], columns=["W", "X", "Y", "Z"])

In [25]:
df

          W         X         Y         Z
A  0.681209  1.035125 -0.031160  1.939932
B -1.005187 -0.741790  0.187125 -0.732845
C -1.382920  1.482495  0.961458 -2.141212
D  0.992573  1.192241 -1.046780  1.292765
E -1.467514 -0.494095 -0.162535  0.485809

In [26]:
bol = df > 0

In [27]:
bol

       W      X      Y      Z
A   True   True  False   True
B  False  False   True  False
C  False   True   True  False
D   True   True  False   True
E  False  False  False   True

In [31]:
df[bol]

          W         X         Y         Z
A  0.681209  1.035125       NaN  1.939932
B       NaN       NaN  0.187125       NaN
C       NaN  1.482495  0.961458       NaN
D  0.992573  1.192241       NaN  1.292765
E       NaN       NaN       NaN  0.485809

In [35]:
df[(df["W"]>0) & (df["Z"] < 1.3)]

          W         X        Y         Z
D  0.992573  1.192241 -1.04678  1.292765

In [37]:
df[(df["W"]>0) & (df["Z"] < 1.3)]["Y"]

D   -1.04678
Name: Y, dtype: float64

In [40]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.681209  1.035125 -0.031160  1.939932
1     B -1.005187 -0.741790  0.187125 -0.732845
2     C -1.382920  1.482495  0.961458 -2.141212
3     D  0.992573  1.192241 -1.046780  1.292765
4     E -1.467514 -0.494095 -0.162535  0.485809

In [42]:
col = ["BA", "SE", "AL","PI", "PE"]

In [46]:
col

['BA', 'SE', 'AL', 'PI', 'PE']

In [48]:
df["Estado"] = col

In [50]:
df

          W         X         Y         Z Estado
A  0.681209  1.035125 -0.031160  1.939932     BA
B -1.005187 -0.741790  0.187125 -0.732845     SE
C -1.382920  1.482495  0.961458 -2.141212     AL
D  0.992573  1.192241 -1.046780  1.292765     PI
E -1.467514 -0.494095 -0.162535  0.485809     PE

In [54]:
df.set_index(keys="Estado", inplace=True)

In [58]:
df

               W         X         Y         Z
Estado
BA      0.681209  1.035125 -0.031160  1.939932
SE     -1.005187 -0.741790  0.187125 -0.732845
AL     -1.382920  1.482495  0.961458 -2.141212
PI      0.992573  1.192241 -1.046780  1.292765
PE     -1.467514 -0.494095 -0.162535  0.485809